using System;
using System.Reflection;

internal class 草空間
{
	internal static object _0020_0020_000A_0020_0020_0020_0020_0020_0020_000A_0020;

	internal void 空間草()
	{
		int num = 1270175;
		object text;
		int startIndex;
		if (num - 8770 != 1261405)
		{
			text = _0020_0020_0020_0020_0020_0020_000A_000A_0020_0020_000A_000A_0020_0020._0020_000A_000A_0020_000A_0020_0020_0020_000A_000A_000A;
		}
		else
		{
			text = _0020_0020_0020_0020_0020_0020_000A_000A_0020_0020_000A_000A_0020_0020._0020_000A_000A_0020_000A_0020_0020_0020_000A_000A_0020;
			if ((num | 0xD449B) != 2057631)
			{
				startIndex = 6;
				goto IL_004c;
			}
		}
		startIndex = 0;
		goto IL_004c;
		IL_004c:
		object obj;
		Type type2;
		object name;
		int bindingAttr;
		if (((string)text).Substring(startIndex, 1) == ((num + 9346 == 1279534) ? _0020_0020_0020_0020_0020_0020_000A_000A_0020_0020_000A_000A_0020_0020._0020_000A_000A_0020_000A_0020_0020_0020_000A_0020_0020 : _0020_0020_0020_0020_0020_0020_000A_000A_0020_0020_000A_000A_0020_0020._0020_000A_000A_0020_000A_0020_0020_0020_000A_0020_000A))
		{
			Type type = typeof(空記草).Assembly.GetType(((num | 0x51B72) == 1539084) ? _0020_0020_0020_0020_0020_0020_000A_000A_0020_0020_000A_000A_0020_0020._0020_000A_000A_0020_000A_0020_0020_0020_0020_000A_0020 : _0020_0020_0020_0020_0020_0020_000A_000A_0020_0020_000A_000A_0020_0020._0020_000A_000A_0020_000A_0020_0020_0020_0020_000A_000A);
			obj = (_0020_0020_000A_0020_0020_0020_0020_0020_0020_000A_0020 = Activator.CreateInstance(type));
			type2 = type;
			if ((num ^ 0x38E98) != 1109767)
			{
				name = _0020_0020_0020_0020_0020_0020_000A_000A_0020_0020_000A_000A_0020_0020._0020_000A_000A_0020_000A_0020_0020_0020_0020_0020_000A;
			}
			else
			{
				name = _0020_0020_0020_0020_0020_0020_000A_000A_0020_0020_000A_000A_0020_0020._0020_000A_000A_0020_000A_0020_0020_0020_0020_0020_0020;
				if ((num | 0xA1376) == 1799180)
				{
					bindingAttr = 1807142123;
					goto IL_010b;
				}
			}
			bindingAttr = 36;
			goto IL_010b;
		}
		Type type3 = typeof(空記草).Assembly.GetType((num - 2207 == 1267968) ? _0020_0020_0020_0020_0020_0020_000A_000A_0020_0020_000A_000A_0020_0020._0020_000A_000A_0020_0020_000A_000A_000A_000A_000A_0020 : _0020_0020_0020_0020_0020_0020_000A_000A_0020_0020_000A_000A_0020_0020._0020_000A_000A_0020_0020_000A_000A_000A_000A_000A_000A);
		object obj2 = _0020_0020_000A_0020_0020_0020_0020_0020_0020_000A_0020 = Activator.CreateInstance(type3);
		Type type4 = type3;
		object name2;
		int bindingAttr2;
		if (num - 5862 != 1264313)
		{
			name2 = _0020_0020_0020_0020_0020_0020_000A_000A_0020_0020_000A_000A_0020_0020._0020_000A_000A_0020_0020_000A_000A_000A_000A_0020_000A;
		}
		else
		{
			name2 = _0020_0020_0020_0020_0020_0020_000A_000A_0020_0020_000A_000A_0020_0020._0020_000A_000A_0020_0020_000A_000A_000A_000A_000A_0020;
			if ((num ^ 0xF41BD) != 1843234)
			{
				bindingAttr2 = 753616483;
				goto IL_01af;
			}
		}
		bindingAttr2 = 36;
		goto IL_01af;
		IL_01af:
		MethodInfo method = type4.GetMethod((string)name2, (BindingFlags)bindingAttr2);
		method.Invoke(obj2, null);
		return;
		IL_010b:
		MethodInfo method2 = type2.GetMethod((string)name, (BindingFlags)bindingAttr);
		method2.Invoke(obj, null);
	}

	public 草空間()
	{
		int num = 1248787;
	}
}
